{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 237], "dtype": "int32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 237], "dtype": "int32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": false, "batch_input_shape": [null, 237], "dtype": "float32", "input_dim": 201114, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 237}, "inbound_nodes": [[["input_3", 0, 0, {}]], [["input_4", 0, 0, {}]]]}, {"name": "lstm_2", "class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 50, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["embedding_2", 0, 0, {}]], [["embedding_2", 1, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAUAAABDAAAAczoAAAB8AFwCfQF9AnQAagF8AWQFZAKNAn0BdABqAXwCZAZk\nAo0CfQJ0AGoCfAF8AhQAZAdkA2QEjQMLAFMAKQhO6QEAAAApAdoEYXhpc1QpAnICAAAA2ghrZWVw\nZGltc+n/////cgQAAAByBAAAACkD2gFL2gxsMl9ub3JtYWxpemXaBG1lYW4pA1oFdmVzdHPaAXja\nAXmpAHIKAAAA+igvaG9tZS91YnVudHUvZHVwbGljYXRlLXF1ZXN0aW9uL3V0aWxzLnB52g9jb3Np\nbmVfZGlzdGFuY2UIAAAAcwgAAAAAAQgBDgEOAQ==\n", null, null], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAwAAAAIAAABDAAAAcxQAAAB8AFwCfQF9AnwBZAEZAGQCZgJTACkDTukAAAAA6QEA\nAACpACkD2gZzaGFwZXPaBnNoYXBlMdoGc2hhcGUycgMAAAByAwAAAPooL2hvbWUvdWJ1bnR1L2R1\ncGxpY2F0ZS1xdWVzdGlvbi91dGlscy5wedoVY29zX2Rpc3Rfb3V0cHV0X3NoYXBlDgAAAHMEAAAA\nAAEIAQ==\n", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["lstm_2", 0, 0, {}], ["lstm_2", 1, 0, {}]]]}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]], "output_layers": [["lambda_2", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}